*** access time records
size = 12800
|   id |      remote |      local |
|    1 |  6190994967 | 5525219763 |
|    2 |  4853278945 | 4454001759 |
|    3 |  5865416519 | 4404425967 |
|    4 |  6259437334 | 5740065838 |
|    5 |  5452799794 | 5076688723 |
| mean | 5724385500. | 5040080410 |
|------+-------------+------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)

It is clear to see the effect of remote access is slower.
  
**** Allocate mx with 12800 * 12800, WITHOUT NUMA awareness
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  430604149 |      935806714 |                            1.30271 |
|    2 |  428375815 |      937043212 |                            1.30204 |
|    3 |  429507786 |      936916666 |                            1.69266 |
|    4 |  428615820 |      937980358 |                            1.30382 |
|    5 |  428463239 |      937544182 |                            1.30078 |
| mean | 429113360. |     937058230. |                           1.380402 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 8 * 20480000, WITHOUT NUMA awareness
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  680044058 |     6681668916 |                            4.02796 |
|    2 |  682953049 |     6676504701 |                            4.02523 |
|    3 |  687956195 |     6677806353 |                            4.02215 |
|    4 |  685070622 |     6677521668 |                            4.01936 |
|    5 |  684318610 |     6677222508 |                            4.02701 |
| mean | 684068510. |    6678144800. |                           4.024342 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 8 * 20480000, WITH NUMA awareness
|   id |   access | multiplication | total execution time of program(s) |
|    1 | 56052365 |      803617342 |                            1.19494 |
|    2 | 55887468 |      804099605 |                            1.20406 |
|    3 | 55422889 |      804668921 |                            1.19966 |
|    4 | 55422889 |      804668921 |                            1.19966 |
|    5 | 55915354 |      803988492 |                            1.19751 |
| mean | 55740193 |     804208660. |                           1.199166 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 12800 * 12800, WITH NUMA awareness
|   id |     access | multiplication | total execution time of program |
|    1 |  162304794 |      153310561 |                         1.01839 |
|    2 |  162328640 |      148230344 |                         1.01127 |
|    3 |  162403576 |      153474228 |                         1.01854 |
|    4 |  161863161 |      154374771 |                         1.01873 |
|    5 |  161203875 |      153011596 |                         1.01798 |
| mean | 162020810. |      152480300 |                        1.016982 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)
*** Use different compilier optimization level to see if the optimization is effect
|   id | access level0 | multiplication level0 | access level2 | multiplication level2 |
|    1 |     335230152 |              86450733 |     329282949 |              28731075 |
|    2 |     319493224 |              86753427 |     317015178 |              20604664 |
|    3 |     322924294 |              80855368 |     332274013 |              28996716 |
|    4 |     322924294 |              80855368 |     320535839 |              25889419 |
| mean |     325142991 |              83728724 |    324776990. |              26055469 |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)::@6$4=vmean(@2..@5)::@6$5=vmean(@2..@5)
From the comparision, we could see that the optimization level indeed take effect, especially on the multipcation case.

*** Compare NUMA vs non-NUMA using OpenMP
- both use optimization level 2
- time measurement
  |      id | non-NUMA access | non-NUMA multiplication | NUMA access | NUMA multiplication |
  |       1 |       262611629 |                25957307 |   319459787 |            27242749 |
  |       2 |       266202154 |                24971359 |   317124380 |            28645037 |
  |       3 |       269134031 |                24630409 |   308853972 |            26528531 |
  |       4 |       273664402 |                23336407 |   311153197 |            29279562 |
  |    mean |       267903054 |                24723871 |   314147834 |           27923970. |
  | pthread |       159383062 |               151926385 |             |                     |
  #+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)::@6$4=vmean(@2..@5)::@6$5=vmean(@2..@5)  label:openmp-performance-table-1

- summary 
  According to this measurement, you could found that NUMA version is worse than non-NUMA version. I think the reason to cause NUMA version is slower is because the OS has to schedule each thread on a specific CPU. That is a too strict to achieve NUMA locality since you actually need to schedule on a set of CPUs for one NUMA node instead of schedule on one particular CPU.

*** Change settings about =OMP_PLACES=
- Change =OMP_PLACES= to:
  #+BEGIN_SRC sh
    export OMP_PLACES="{0, 4, 8, 12, 16, 20, 24, 28}, {32, 36, 40, 44, 48, 52, 56, 60}, {2, 6, 10, 14, 18, 22, 26, 30}, {34, 38, 42, 46, 50, 54, 58, 62}, {3, 7, 11, 15, 19, 23, 27, 31}, {35, 39, 43, 47, 51, 55, 59, 63}, {1, 5, 9, 13, 17, 21, 25, 29}, {33, 37, 41, 45, 49, 53, 57, 61}"
  #+END_SRC

- time measurement, with optimization level = 2
  |   id | non-NUMA access | non-NUMA multiplication | NUMA access | NUMA multiplication |
  |    1 |       283806290 |                45075298 |   308910591 |            26020108 |
  |    2 |       292365042 |                66875479 |   313655646 |            27090225 |
  |    3 |       303580500 |                69254549 |   322728477 |            23495901 |
  |    4 |       280702041 |                39244008 |   329080558 |            28275037 |
  |    5 |       294252690 |                34725024 |   323499789 |            27878445 |
  |    6 |       279747220 |                37873401 |   341436966 |            30811872 |
  | mean |      289075630. |               48841293. |  323218670. |           27261931. |
  #+TBLFM: @8$2=vmean(@2..@7)::@8$3=vmean(@2..@7)::@8$4=vmean(@2..@7)::@8$5=vmean(@2..@7)

- summary
  - It seems my expectation for relaxing the schedule on set of CPUs instead of on one particular CPU doesn't work well as I expected. The reason I think is the OS scheduler could schedule multiple threads on the same CPU. So it actually make the performance worse than previous setting, for both NUMA and non-NUMA case.
  - Access time for non-NUMA is still faster than NUMA
  - Multiplication time for NUMA is better than non-NUMA, while it shows no advantage over non-NUMA while =OMP_PLACES= is configure to fix on each CPU.

*** Increase the size of data to make NUMA effect more important
- From previous experiments, it shows when =OMP_PLACES= is set to schedule on each CPU, the performance is better for both NUMA and non-NUMA; and non-NUMA is better than NUMA. In this experiment, continue to increase the size of data, to make NUMA effect more important to see OpenMP under NUMA awareness is whether better or worse comparing with non-NUMA.
- time measurement, 25600 * 25600, with optimization level 2
  |   id | non-NUMA access | non-NUMA multipcation | NUMA access | NUMA multipcation |
  |    1 |      1136666571 |              77452377 |  1124357282 |          78184265 |
  |    2 |      1036407809 |              85516505 |  1107078429 |          77917661 |
  |    3 |      1063054334 |              78347814 |  1101156621 |          79212596 |
  |    4 |      1035991932 |              77821935 |  1086195798 |          78019858 |
  |    5 |      1026371449 |              84138365 |  1071735039 |          78102814 |
  |    6 |      1030569386 |              79861620 |  1099029846 |          84898814 |
  | mean |     1054843600. |             80523103. | 1098258800. |         79389335. |
  #+TBLFM: @8$2=vmean(@2..@7)::@8$3=vmean(@2..@7)::@8$4=vmean(@2..@7)::@8$5=vmean(@2..@7)
- summary
  I expected the NUMA performance will be better than non-NUMA, but from the result, it doesn't shows an obvious advantage. There may be something wrong.

*** Configure OpenMP to access remote node to verfiy the NUMA awareness effect from negative point of view
- Since by configuring OpenMP with NUMA doesn't show advantage over non-NUMA configuration. I need to proof that from a negative point of view by configure NUMA access from remote nodes.
- Configure all memory allocate on NUMA node 7, and expected the performance become worse becuase 56/64 threads will access memory remotely
- time measurement, 12800 * 12800, with optimization level 2
  |   id | NUMA access | NUMA multiplication |
  |    1 |   306617492 |            32410022 |
  |    2 |   309534292 |            31684650 |
  |    3 |   298530840 |            24370234 |
  |    4 |   304718160 |            27047280 |
  |    5 |   312366607 |            27151744 |
  |    6 |   308791332 |            25503240 |
  |    7 |   308954756 |            26223124 |
  | mean |  307073350. |            27770042 |
  #+TBLFM: @9$2=vmean(@2..@8)::@9$3=vmean(@2..@8)

- summary
  compare it with table ref:openmp-performance-table-1, the result is similar...

*** Measure the pthread execution time 
- before specify =-mhard-float=, means generate output containing floating point instructions, this is the default. 
  |   id |    access | multipcation |
  |    1 | 160274465 |    151846524 |
  |    2 | 157219317 |    151687159 |
  |    3 | 158095075 |    149357437 |
  |    4 | 158095075 |    149357437 |
  | mean | 158420983 |    150562140 |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)

- after specify =-mhard-float=
  |   id |    access | multiplication |
  |    1 | 161272758 |      158283874 |
  |    2 | 157998876 |      149994785 |
  |    3 | 156882903 |      154323816 |
  |    4 | 152328315 |      154846556 |
  | mean | 157120713 |      154362260 |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)
- summary, from the documentation, =-mhard-float= is indeed the default option, the performance doesn't show improvement.
  It seems I have to check the assembly code to figure out why the performance is so different between OpenMP and pthread
**** time mesurement 
#+BEGIN_SRC sh
  cat numa_openmp.sh
  export OMP_PLACES="{0, 4, 8, 12, 16, 20, 24, 28}, {32, 36, 40, 44, 48, 52, 56, 60}, {2, 6, 10, 14, 18, 22, 26, 30}, {34, 38, 42, 46, 50, 54, 58, 62}, {3, 7, 11, 15, 19, 23, 27, 31}, {35, 39, 43, 47, 51, 55, 59, 63}, {1, 5, 9, 13, 17, 21, 25, 29}, {33, 37, 41, 45, 49, 53, 57, 61}"
  ./bin/numa_openmp 16000 16000 8
  ./bin/anti_numa_openmp 16000 16000 8
  ./bin/openmp_without_numa 16000 16000 8
#+END_SRC
|   id | use libnuma(ms) | not use libnuma(ms) | use libnuma on remote node |
|    1 |            3880 |                 420 |                       3934 |
|    2 |            4034 |                 416 |                       3973 |
|    3 |            4020 |                 418 |                       3960 |
|    4 |            3975 |                 419 |                       3951 |
|    5 |            4033 |                 413 |                       3908 |
| mean |          3988.4 |               417.2 |                     3945.2 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)
- It seems this approach make the libnuma case becomes worse.
- The execution time of using libnuma and the execution time of using libnuma but allocated memory deliberately on remote node is also similar. This indicate I have lot of remote memory access cases.
- This whole program is wrong because each row of the matrix need to multiple very element of vector, there is no point of allocation vector across multiple nodes.

